# INTRODUCTION

***Pandas is generally used for Data Analysis.***
***It allows importing data from various file formats ex- Json,csv,Sql,Excel,etc***

***FEATURES:
    Data Manipulation,
    Reading and Writing Data,
    Reshaping of data,
    Data Filteration,
    Data cleaning***

# **Creating Dataframe**

The best way to create a dataframe in python is to use **Dictionary**

In [1]:
import pandas as pd

In [2]:
dict_1={"car":["city","ignis","800","Verna","Venue","Punto"],"brand":["Honda","maruti","Maruti","Hyundia","Hyundai","Fiat"],
         "cost":[900000,600000,100000,800000,950000,750000],"year":[5,7,10,4,2,6]}

In [3]:
auto=pd.DataFrame(dict_1)

In [4]:
auto

     car    brand    cost  year
0   city    Honda  900000     5
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

In [5]:
auto.to_csv('automobile.csv')

In [6]:
# Import the os module
import os

# Get the current working directory
cwd = os.getcwd()
cwd

'/Users/anuradhadhanda/Downloads/PersonalStudy/UDEMY/Python for Machine Learning with Numpy, Pandas & Matplotlib'

# ***Importing Dataframe***

In [7]:

import pandas as pd

In [8]:
data=pd.read_csv("Titanic.csv")

In [9]:
data.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1312 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 51.4+ KB

In [11]:
data.shape

(1313, 5)

In [12]:
data.columns

Index(['Name', 'PClass', 'Age', 'Sex', 'Survived'], dtype='object')

In [13]:
data['Survived'].value_counts()

0    863
1    450
Name: Survived, dtype: int64

In [14]:
data["Sex"].unique()

array(['female', 'male'], dtype=object)

# ***Accessing Columns***

In [15]:
data['Name']

0                        Allen, Miss Elisabeth Walton
1                         Allison, Miss Helen Loraine
2                 Allison, Mr Hudson Joshua Creighton
3       Allison, Mrs Hudson JC (Bessie Waldo Daniels)
4                       Allison, Master Hudson Trevor
                            ...
1308                               Zakarian, Mr Artun
1309                           Zakarian, Mr Maprieder
1310                                 Zenni, Mr Philip
1311                                 Lievens, Mr Rene
1312                                   Zimmerman, Leo
Name: Name, Length: 1313, dtype: object

In [16]:
data[['Name','Sex']]

                                               Name     Sex
0                      Allen, Miss Elisabeth Walton  female
1                       Allison, Miss Helen Loraine  female
2               Allison, Mr Hudson Joshua Creighton    male
3     Allison, Mrs Hudson JC (Bessie Waldo Daniels)  female
4                     Allison, Master Hudson Trevor    male
...                                             ...     ...
1308                             Zakarian, Mr Artun    male
1309                         Zakarian, Mr Maprieder    male
1310                               Zenni, Mr Philip    male
1311                               Lievens, Mr Rene    male
1312                                 Zimmerman, Leo    male

[1313 rows x 2 columns]

# Accessing Rows

In [17]:
data.iloc[[0]]

                           Name PClass   Age     Sex  Survived
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1

In [18]:
data.loc[1:5,['Name',"Sex"]]

                                            Name     Sex
1                    Allison, Miss Helen Loraine  female
2            Allison, Mr Hudson Joshua Creighton    male
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  female
4                  Allison, Master Hudson Trevor    male
5                             Anderson, Mr Harry    male

# ***Filtering of data***

In [19]:
new_data=data["Sex"]=="male"

In [20]:
data.loc[new_data]

                                     Name PClass    Age   Sex  Survived
2     Allison, Mr Hudson Joshua Creighton    1st  30.00  male         0
4           Allison, Master Hudson Trevor    1st   0.92  male         1
5                      Anderson, Mr Harry    1st  47.00  male         1
7                  Andrews, Mr Thomas, jr    1st  39.00  male         0
9                  Artagaveytia, Mr Ramon    1st  71.00  male         0
...                                   ...    ...    ...   ...       ...
1308                   Zakarian, Mr Artun    3rd  27.00  male         0
1309               Zakarian, Mr Maprieder    3rd  26.00  male         0
1310                     Zenni, Mr Philip    3rd  22.00  male         0
1311                     Lievens, Mr Rene    3rd  24.00  male         0
1312                       Zimmerman, Leo    3rd  29.00  male         0

[851 rows x 5 columns]

In [21]:
isin_1 = auto['car'].isin(['800','city'])

In [22]:
auto.loc[isin_1]

    car   brand    cost  year
0  city   Honda  900000     5
2   800  Maruti  100000    10

In [23]:
start=auto['brand'].str.startswith('H')
auto.loc[start]

     car    brand    cost  year
0   city    Honda  900000     5
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2

In [24]:
ends = auto['brand'].str.endswith('i')
auto.loc[ends]

     car    brand    cost  year
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
4  Venue  Hyundai  950000     2

In [25]:
contains = ~auto['brand'].str.contains('o')
auto.loc[contains]

     car    brand    cost  year
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

In [26]:
auto.loc[-contains]

    car  brand    cost  year
0  city  Honda  900000     5

In [27]:
isna = auto['car'].isna()
auto.loc[isna]

Empty DataFrame
Columns: [car, brand, cost, year]
Index: []

In [28]:
notna = auto['car'].notna()
auto.loc[notna]

     car    brand    cost  year
0   city    Honda  900000     5
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

# Sorting of Data

In [29]:
auto.sort_values("cost")

     car    brand    cost  year
2    800   Maruti  100000    10
1  ignis   maruti  600000     7
5  Punto     Fiat  750000     6
3  Verna  Hyundia  800000     4
0   city    Honda  900000     5
4  Venue  Hyundai  950000     2

In [30]:
data.sort_values(['Age', 'Sex'],
                       ascending=[True, False])

                                        Name PClass   Age     Sex  Survived
763     Dean, Miss Elizabeth Gladys (Millve)    3rd  0.17  female         1
751   Danbom, Master Gilbert Sigvard Emanuel    3rd  0.33    male         0
544           Richards, Master George Sidney    2nd  0.80    male         1
358             Caldwell, Master Alden Gates    2nd  0.83    male         1
616                       Aks, Master Philip    3rd  0.83    male         1
...                                      ...    ...   ...     ...       ...
1251              Thorneycroft, Mrs Percival    3rd   NaN  female         1
1259              Touma (Thomas), Mrs Darwin    3rd   NaN  female         0
1261               Touma (Thomas), Miss Hanh    3rd   NaN  female         0
1306                     Zabour, Miss Hileni    3rd   NaN  female         0
1307                     Zabour, Miss Tamini    3rd   NaN  female         0

[1313 rows x 5 columns]

# ***Updating Columns and Rows***

Changing the name of columns

In [31]:
auto.columns=[x.capitalize() for x in auto.columns]

In [32]:
auto

     Car    Brand    Cost  Year
0   city    Honda  900000     5
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

In [33]:
auto.columns=[x.lower() for x in auto.columns]

In [34]:
auto

     car    brand    cost  year
0   city    Honda  900000     5
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

In [35]:
auto.rename(columns={"brand":"company","cost":"price"},inplace=True)

In [36]:
auto

     car  company   price  year
0   city    Honda  900000     5
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

***Updating Columns***

In [37]:
auto["price"]=auto["price"].replace({600000:100000})

In [38]:
auto

     car  company   price  year
0   city    Honda  900000     5
1  ignis   maruti  100000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

In [39]:
auto["car"].apply(str.upper)

0     CITY
1    IGNIS
2      800
3    VERNA
4    VENUE
5    PUNTO
Name: car, dtype: object

In [40]:
def price_change(price):
    return price/10

In [41]:
auto["price"].apply(price_change)

0    90000.0
1    10000.0
2    10000.0
3    80000.0
4    95000.0
5    75000.0
Name: price, dtype: float64

In [42]:
auto["price"].apply(lambda x:x*10)

0    9000000
1    1000000
2    1000000
3    8000000
4    9500000
5    7500000
Name: price, dtype: int64

In [43]:
auto["car"].replace({"city":"city zx","ignis":"swift"})

0    city zx
1      swift
2        800
3      Verna
4      Venue
5      Punto
Name: car, dtype: object

***Updating Rows***

In [44]:
auto.loc[2,["car","price"]]=["dezire",600000]

In [45]:
auto

      car  company   price  year
0    city    Honda  900000     5
1   ignis   maruti  100000     7
2  dezire   Maruti  600000    10
3   Verna  Hyundia  800000     4
4   Venue  Hyundai  950000     2
5   Punto     Fiat  750000     6

***Adding and removing a column***

In [46]:
fuel_type=["Diesel","Petrol","Petrol","Diesel","Petrol","Diesel"]

In [47]:
auto["Fuel Types"]=fuel_type

In [48]:
auto

      car  company   price  year Fuel Types
0    city    Honda  900000     5     Diesel
1   ignis   maruti  100000     7     Petrol
2  dezire   Maruti  600000    10     Petrol
3   Verna  Hyundia  800000     4     Diesel
4   Venue  Hyundai  950000     2     Petrol
5   Punto     Fiat  750000     6     Diesel

In [49]:
auto.drop("Fuel Types",axis=1,inplace=True)

***Adding and Removing Rows***

In [50]:
auto=auto.append({"car":"Tiago","company":"TATA"},ignore_index=True)

In [51]:
auto.drop(index=6)

      car  company     price  year
0    city    Honda  900000.0   5.0
1   ignis   maruti  100000.0   7.0
2  dezire   Maruti  600000.0  10.0
3   Verna  Hyundia  800000.0   4.0
4   Venue  Hyundai  950000.0   2.0
5   Punto     Fiat  750000.0   6.0

# Grouping And Aggregation

In [52]:
groups = data.groupby(['Sex'])

In [53]:
groups.mean()

              Age  Survived
Sex
female  29.396424  0.666667
male    31.014338  0.166863

In [54]:
groups.size()

Sex
female    462
male      851
dtype: int64

In [55]:
groups.count()

        Name  PClass  Age  Survived
Sex
female   462     462  288       462
male     851     850  468       851

# Cleaning of Data

In [56]:
import numpy as np

dict_1={"car":["city","ignis",np.nan,"Verna","Venue","Punto",np.nan],"brand":["Honda","maruti","Maruti","Hyundia",np.nan,"Fiat",np.nan],
         "cost":[900000,600000,np.nan,800000,950000,750000,np.nan,],"year":[5,7,10,np.nan,np.nan,6,np.nan]}        


auto=pd.DataFrame(dict_1)

In [57]:
auto.isnull().sum()

car      2
brand    2
cost     2
year     3
dtype: int64

In [58]:
auto.dropna(axis="index",how='all',subset=["cost"])

     car    brand      cost  year
0   city    Honda  900000.0   5.0
1  ignis   maruti  600000.0   7.0
3  Verna  Hyundia  800000.0   NaN
4  Venue      NaN  950000.0   NaN
5  Punto     Fiat  750000.0   6.0

In [59]:
auto["cost"].fillna(0,inplace=True)

In [60]:
auto

     car    brand      cost  year
0   city    Honda  900000.0   5.0
1  ignis   maruti  600000.0   7.0
2    NaN   Maruti       0.0  10.0
3  Verna  Hyundia  800000.0   NaN
4  Venue      NaN  950000.0   NaN
5  Punto     Fiat  750000.0   6.0
6    NaN      NaN       0.0   NaN